#!/usr/bin/env python
# -*- encoding: utf-8 -*-
'''
@File    :   city_all_name.py    
@Contact :   cubecats@icloud.com
@License :   (C)Copyright 2017-2018, DAMN-CAT

@Modify Time        @Author     @Version    @Desciption
------------        --------    --------    -----------
2020/3/8 下午1:39    damn cat    1.0         None
'''


# import lib
def get_all_city_name():
    return {'热门': ['成都', '北京', '上海', '重庆', '广州', '成都', '苏州', '杭州', '哈尔滨', '西安', '三亚', '厦门', '南京'],
            'A': ['安吉', '安图', '安庆', '安康', '安阳', '安顺', '澳门', '阿克苏', '阿勒泰', '阿坝', '阿尔山', '阿拉善', '阿里', '鞍山'],
            'B': ['亳州', '保亭', '保定', '保山', '包头', '北京', '北戴河', '北海', '博尔塔拉', '宝鸡', '巴中', '巴彦淖尔', '巴音郭楞', '巴马', '布尔津',
                  '本溪', '毕节', '滨州', '白城', '白山', '白银', '百色', '蚌埠'],
            'C': ['从化区', '崇州', '崇左', '崇礼区', '常州', '常德', '常熟', '慈溪', '成都', '承德', '昌吉', '昌江', '昌都', '朝阳', '楚雄', '池州',
                  '沧州', '淳安', '滁州', '潮州', '澄迈', '赤峰', '郴州', '重庆', '长岛', '长春', '长沙', '长治', '长白山'],
            'D': ['东莞', '东营', '东阳', '丹东', '丹巴', '儋州', '大兴安岭', '大同', '大庆', '大理', '大连', '大邑', '定安', '定西', '德宏', '德州',
                  '德清', '德阳', '敦化', '敦煌', '登封', '稻城', '达州', '迪庆', '都江堰'], 'E': ['峨眉山', '恩施', '鄂尔多斯', '鄂州'],
            'F': ['佛山', '凤凰', '奉化区', '抚州', '抚顺', '福州', '福鼎', '阜新', '阜阳', '防城港'],
            'G': ['固原', '广元', '广安', '广州', '广汉', '果洛', '桂林', '甘南', '甘孜', '贵港', '贵阳', '赣州', '高雄'],
            'H': ['华山', '华阴', '合肥', '呼伦贝尔', '呼和浩特', '和田', '哈密市', '哈尔滨', '怀化', '惠东', '惠州', '杭州', '横店影视城', '汉中', '河池',
                  '河源', '海东', '海北', '海口', '海螺沟', '海西', '海阳', '淮北', '淮南', '淮安', '湖州', '红原', '红河', '花莲', '菏泽', '葫芦岛',
                  '衡山', '衡水', '衡阳', '贺州', '邯郸', '香港', '鹤壁', '鹤岗', '黄冈', '黄南', '黄山', '黄果树', '黄石', '黑河'],
            'J': ['九华山', '九寨沟', '九江', '井冈山', '佳木斯', '即墨区', '吉安', '吉林市', '嘉义市', '嘉兴', '嘉善', '嘉峪关', '基隆', '建水', '揭阳',
                  '晋中', '晋城', '景德镇', '景洪', '江门', '济南', '济宁', '济源', '焦作', '绩溪', '荆州', '荆门', '酒泉', '金华', '金昌', '金门', '锦州',
                  '靖西', '鸡西'], 'K': ['克什克腾旗', '克孜勒苏', '克拉玛依', '凯里', '喀什', '喀纳斯', '康定', '开封', '开平', '昆山', '昆明'],
            'L': ['临夏', '临安区', '临汾', '临沂', '临沧', '临高', '丽水', '丽江', '乐东', '乐山', '六安', '六盘水', '兰州', '凉山', '利川', '吕梁',
                  '娄底', '庐山风景区', '廊坊', '拉萨', '来宾', '林芝', '柳州', '泸州', '洛阳', '浏阳', '溧阳', '漯河', '聊城', '荔波', '莱芜区', '辽源',
                  '辽阳', '连云港', '连城', '陇南', '陵水', '雷山', '黎平', '龙岩', '龙虎山'],
            'M': ['弥勒', '梅州', '满洲里', '漠河', '澳门', '牡丹江', '眉山', '绵阳', '芒市', '苗栗', '茂名', '马鞍山'],
            'N': ['内江', '南京', '南充', '南宁', '南平', '南投市', '南昌', '南浔古镇', '南通', '南阳', '南靖', '宁德', '宁波', '宁海', '宁蒗', '怒江',
                  '那曲'], 'P': ['屏东', '平凉', '平遥', '平顶山', '攀枝花', '普洱', '普陀山', '澎湖', '濮阳', '盘锦', '莆田', '萍乡', '蓬莱'],
            'Q': ['七台河', '千岛湖', '庆阳', '曲阜', '曲靖', '泉州', '清远', '琼海', '秦皇岛', '衢州', '钦州', '青岛', '黔东南', '黔南', '黔西南',
                  '齐齐哈尔'], 'R': ['日喀则', '日照', '若尔盖'],
            'S': ['三亚', '三明', '三清山', '三门峡', '上海', '上饶', '十堰', '双鸭山', '商丘', '商洛', '四平', '宿州', '宿迁', '山南', '朔州', '松原',
                  '汕头', '汕尾', '沈阳', '深圳', '石嘴山', '石家庄', '石林', '石河子', '神农架', '绍兴', '绥化', '苏州', '遂宁', '邵阳', '随州', '韶关',
                  '韶山'],
            'T': ['台东', '台中', '台北', '台南', '台山', '台州', '吐鲁番市', '唐山', '塔城', '天水', '天津', '太仓', '太原', '太湖', '屯昌', '桃园市',
                  '桐乡', '桐庐', '泰宁', '泰安', '泰山', '泰州', '腾冲', '通化', '通辽', '铁岭', '铜仁', '铜川', '铜陵'],
            'W': ['万宁', '乌兰察布', '乌镇', '乌鲁木齐', '乌鲁木齐县', '五台山', '五指山', '吴忠', '威海', '婺源', '文山', '文昌', '无锡', '梧州', '武义',
                  '武夷山', '武威', '武当山', '武汉', '武隆区', '汶川', '温州', '渭南', '潍坊', '芜湖'],
            'X': ['信阳', '兴城', '兴安盟', '厦门', '咸宁', '咸阳', '孝感', '宣城', '徐州', '忻州', '新乡', '新余', '新北', '新竹', '湘潭', '湘西', '襄阳',
                  '西双版纳', '西塘', '西宁', '西安', '西昌', '许昌', '象山', '邢台', '锡林郭勒盟', '雪乡', '香格里拉', '香港'],
            'Y': ['义乌', '云林县', '云浮', '亚布力滑雪旅游度假区', '伊宁市', '伊春', '伊犁', '宜兰', '宜兴', '宜宾', '宜昌', '宜春', '岳阳', '延吉', '延安',
                  '延边', '扬州', '榆林', '永州', '烟台', '玉林', '玉树', '玉溪', '益阳', '盐城', '营口', '运城', '银川', '阳朔', '阳江', '阳泉', '雅安',
                  '鹰潭'],
            'Z': ['中卫', '中山', '周口', '周庄', '张家口', '张家界', '张掖', '彰化', '昭通', '枣庄', '株洲', '淄博', '湛江', '漳州', '珠海', '肇庆',
                  '自贡', '舟山', '资阳', '遵义', '郑州', '镇江', '镇远', '驻马店']}
